# Aceleração em Data Science - Semana 2

## Manipulando dados - Pandas

In [2]:
# Importando os dados

import pandas as pd
import numpy as np

In [2]:
# Acessando o help dos pacotes

pd?

In [3]:
# No final do notebook mostro como fazer a leitura de diferentes tipos de dados e bancos

### Dicionários

In [4]:
# Criando um dicionário com os dados

dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos' : [100, 200, 300, 400, 500],
        'site' : ['site1', 'site1', 'site2', 'site2', ' site3'],
        'vendas' : [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
# Para printar o dicionário

dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', ' site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [6]:
# Verificando o tipo do dicionário

type(dados)

dict

In [7]:
# Acessando as chaves do meu dicionário

dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [8]:
# Acessando uma chave específica

dados['canal_venda']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [9]:
# Acessando uma posição específica de um dicionário

dados['canal_venda'][4]

'facebook'

In [10]:
# Acessando uma posição específica de um dicionário

dados['canal_venda'][:2]

['facebook', 'twitter']

In [11]:
# Acessando uma posição específica de um dicionário

dados['canal_venda'][2:]

['instagram', 'linkedin', 'facebook']

### Listas

In [12]:
# Criando uma lista

lista = [200, 200, 300, 800, 200]

In [13]:
# Para verificar o tipo do dado

type(lista)

list

In [14]:
# Printando a lista

lista

[200, 200, 300, 800, 200]

In [15]:
# Vendo valores específicos

lista[2]

300

In [16]:
# Fatia da lista

lista[:3]

[200, 200, 300]

In [17]:
lista[3:]

[800, 200]

In [18]:
# Adicionando a lista ao dicionário

dados['lista'] = lista
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', ' site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [19]:
# Criar um dataframe a partir de um dict

dataframe = pd.DataFrame(dados)

In [20]:
# Acessando o dataframe

dataframe

  canal_venda  acessos    site   vendas  lista
0    facebook      100   site1  1000.52    200
1     twitter      200   site1  1052.34    200
2   instagram      300   site2  2002.00    300
3    linkedin      400   site2  5000.00    800
4    facebook      500   site3   300.00    200

In [21]:
# Printando os primeiros casos do dataframe

dataframe.head(1)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200

In [22]:
# Verificando o formato do dataframe

dataframe.shape

(5, 5)

In [23]:
# Verificando o indice do dataframe

dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
# Verificando os tipos de dados do dataframe

dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [25]:
# Verificando os tipos de dados do dataframe

dataframe.dtypes.value_counts()

object     2
int64      2
float64    1
dtype: int64

In [26]:
# Verificando se existem valores faltantes

dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [27]:
# Verificando se existem valores faltantes

dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [28]:
# Printando os nomes das colunas

dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [29]:
# Acessando uma coluna especifíca

dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [30]:
# Transformando em lista

list(dataframe['canal_venda'])

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [31]:
# Criando uma nova coluna

dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [32]:
# Exibindo as colunas

dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [33]:
# Exibindo o dataframe

dataframe

  canal_venda  acessos    site   vendas  lista  nova_coluna
0    facebook      100   site1  1000.52    200            1
1     twitter      200   site1  1052.34    200            2
2   instagram      300   site2  2002.00    300            3
3    linkedin      400   site2  5000.00    800            4
4    facebook      500   site3   300.00    200            5

In [34]:
# Removendo colunas

dataframe.drop(columns = 'nova_coluna', inplace = True) # inplace = True remove de forma permanente

In [35]:
# Removendo mais de uma coluna

# dataframe.drop(columns = ['acessos', 'site']) # passa as colunas como lista

In [36]:
# Exibindo as colunas

dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [37]:
# Acessando valores especificos (passando o indice)

dataframe['canal_venda'][2]

'instagram'

In [38]:
# Acessando fatia de coluna especifica

dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [39]:
# Fatiando os dados usando iloc (linhas, colunas)

dataframe.iloc[:2, 2:]

    site   vendas  lista
0  site1  1000.52    200
1  site1  1052.34    200

In [40]:
# Fatiando os dados usando loc (indice)

dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800

In [41]:
# Selecionando colunas especificas

dataframe[['canal_venda', 'acessos']]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [42]:
# Passando os valores atraves de lista

filtro = ['canal_venda', 'acessos']
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [43]:
# Usando o método info()

dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
canal_venda    5 non-null object
acessos        5 non-null int64
site           5 non-null object
vendas         5 non-null float64
lista          5 non-null int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [44]:
# Pivotando os dados (coluna) 

dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos')

site          site3  site1  site2
canal_venda
facebook      500.0  100.0    NaN
instagram       NaN    NaN  300.0
linkedin        NaN    NaN  400.0
twitter         NaN  200.0    NaN

In [45]:
# Exemplo para aplicar info

aux = dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos')
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 site3    1 non-null float64
site1     2 non-null float64
site2     2 non-null float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [46]:
# Completando os valores faltantes usando fillna
# Pivotando os dados (coluna)

aux = dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)

dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)

site          site3  site1  site2
canal_venda
facebook      500.0  100.0    0.0
instagram       0.0    0.0  300.0
linkedin        0.0    0.0  400.0
twitter         0.0  200.0    0.0

In [47]:
# Substituindo fillna com mean, median, mode

dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(dataframe['acessos'].mean())
# Passa mean, median ou mode e inplace = True para mudar de forma permanente

site          site3  site1  site2
canal_venda
facebook      500.0  100.0  300.0
instagram     300.0  300.0  300.0
linkedin      300.0  300.0  400.0
twitter       300.0  200.0  300.0

In [48]:
# Mudando as colunas usando o comando melt
# Quando é bom usar: para agrupar/reduzir colunas, criar categorias com base em valores especificos

dataframe.melt(id_vars = 'site', value_vars = ['canal_venda'])

     site     variable      value
0   site1  canal_venda   facebook
1   site1  canal_venda    twitter
2   site2  canal_venda  instagram
3   site2  canal_venda   linkedin
4   site3  canal_venda   facebook

In [49]:
# Resetando o indice do dataframe

print(aux.columns)

aux = aux.reset_index()

print(aux.columns)

Index([' site3', 'site1', 'site2'], dtype='object', name='site')
Index(['canal_venda', ' site3', 'site1', 'site2'], dtype='object', name='site')

In [50]:
# Exemplo do comando melt

aux.melt(id_vars = 'canal_venda', value_vars = ['site1', 'site2'])

  canal_venda   site  value
0    facebook  site1  100.0
1   instagram  site1    0.0
2    linkedin  site1    0.0
3     twitter  site1  200.0
4    facebook  site2    0.0
5   instagram  site2  300.0
6    linkedin  site2  400.0
7     twitter  site2    0.0

In [51]:
# Somando as colunas do dataframe

dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                         site1site1site2site2 site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [52]:
# Somando as linhas do dataframe

dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [53]:
# Calculando a mediana das colunas numericas

print('Por linha: ', dataframe.median(axis = 1))

print('Por coluna: ', dataframe.median()) # o default são as colunas

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Por coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [54]:
# Calculando a media das colunas numericas
# Tambem posso passar o axis = 1 e calcular por linha

dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [55]:
# Calculando o desvio padrao das colunas numericas
# Tambem posso passar o axis = 1 e calcular por linha

dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [56]:
# Comando describe calcula estatisticas descritivas para colunas numericas

dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [57]:
# Calculando a moda

dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

In [58]:
# Valor maximo por coluna

dataframe.max()

canal_venda    twitter
acessos            500
site             site2
vendas            5000
lista              800
dtype: object

In [59]:
# Valor minimo por coluna 

dataframe.min()

canal_venda    facebook
acessos             100
site              site3
vendas              300
lista               200
dtype: object

In [60]:
# Printando o numero de unicos

dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [61]:
# Contando valores unicos de uma coluna

dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
instagram    1
linkedin     1
Name: canal_venda, dtype: int64

In [62]:
# Valores unicos de uma coluna

dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [63]:
# Usando o groupby com valores numericos

dataframe.groupby('site')['acessos'].sum()

site
 site3    500
site1     300
site2     700
Name: acessos, dtype: int64

In [64]:
# Usando o groupby com valores numericos

dataframe.groupby('site')['acessos'].mean()

site
 site3    500
site1     150
site2     350
Name: acessos, dtype: int64

In [65]:
# Usando o groupby com dados categoricos

dataframe.groupby('site')['canal_venda'].unique()

site
 site3               [facebook]
site1       [facebook, twitter]
site2     [instagram, linkedin]
Name: canal_venda, dtype: object

In [66]:
# Usando o groupby com dados categoricos

dataframe.groupby('site')['canal_venda'].first()

site
 site3     facebook
site1      facebook
site2     instagram
Name: canal_venda, dtype: object

In [67]:
# Usando o groupby com a funcao agg (aggregate)

dataframe.groupby('canal_venda').agg({'site' : 'unique',
                                     'acessos' : 'sum'})

                        site  acessos
canal_venda
facebook     [site1,  site3]      600
instagram            [site2]      300
linkedin             [site2]      400
twitter              [site1]      200

In [68]:
# Correlacoes entre variaveis

dataframe.corr()

# Posso passar o metodo que eu quero
# dataframe.corr(method = 'spearman')

          acessos    vendas     lista
acessos  1.000000  0.217542  0.363803
vendas   0.217542  1.000000  0.979211
lista    0.363803  0.979211  1.000000

In [69]:
# Criando variaveis categoricas por fatia de variavel numerica

dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                      bins = (1, 1500, 2000, 8000),
                                      labels = ('0 a 1500', '1500 a 2000', ' 2000 a 8000'))

In [70]:
# Crianco variavel categorica usando compreensão de lista

dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [71]:
# Juntando dois dataframes | Criando o dataframe2

dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'], 
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [72]:
# Realizando o merge

dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,NaN

In [73]:
# Salvando o dataframe como csv

dataframe.to_csv('dataframe_semana2.csv', sep = ';', decimal = ',', index = False)

In [74]:
# Lendo dados no formato csv

dataframe_leitura = pd.read_csv('dataframe_semana2.csv', sep = ';', decimal = ',')

In [75]:
dataframe_leitura.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [76]:
# Observação: é possível fazer a leitura de diferentes tipos de arquivos e não somente csv

# Veja como ler outros tipos de arquivos em: https://pandas.pydata.org/pandas-docs/stable/reference/io.html

In [77]:
# Para leitura de dados do PostgreSQL

# import psycopg2

# connection = psycopg2.connect(host='', dbname='', user='', password='')
# cursor = connection.cursor()  # Permite que o código Python execute o comando PostgreSQL em uma sessão de banco de dados
# cursor.execute('SELECT * FROM ')  # Executa a operacao no banco
# futuro_df = cursor.fetchall()   # Busca tds as linhas de um resultado da consulta, retornando como uma lista de tuplas
# col = [c[0] for c in cursor.description]
# cursor.close()
# connection.close()

In [78]:
# Para leitura de dados do Mongo

# pip install pymongo[srv]
# from pymongo import MongoClient

# client = MongoClient('')
# database = client['']
# collection = database['']
# cursor = collection.find({})
# df =  pd.DataFrame(list(cursor)) # Expande o cursor e constroi o DataFrame

### Imputação de dados
###### Dica: take easy!

In [3]:
df = pd.read_csv('train.csv')

In [5]:
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.198653
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [6]:
# Dados númericos podem ser substituidos por: média ou mediana
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [7]:
# Dados categoricos podem ser substituidos por: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [8]:
df['Cabin'].value_counts()

Unknown        687
G6               4
B96 B98          4
C23 C25 C27      4
C22 C26          3
              ...
B94              1
A5               1
E46              1
E58              1
A32              1
Name: Cabin, Length: 148, dtype: int64

In [10]:
df.shape

(891, 12)